export default () => {
  let id = 0
  let result = []
  placeMocks.forEach(placeMock => {
    placeMock.spaceIDs.forEach(spaceID => {
      let obj = { occupiedAt: null, user: null }
      obj.placeName = placeMock.placeName
      obj.spaceID = spaceID
      obj.id = id++
      result.push(obj)
    })
  })
  return result
}

const placeMocks = [
  {
    placeName: '성호관',
    spaceIDs: [
      '104',
      '105',
      '131',
      '132',
      '133',
      '135',
      '201',
      '201-1',
      '202',
      '203',
      '204',
      '205',
      '232',
      '233',
      '234',
      '235',
      '236',
      '237',
      '304',
      '305',
      '306',
      '332',
      '333',
      '334',
      '337',
      '339'
    ]
  },
  {
    placeName: '율곡관',
    spaceIDs: [
      '150',
      '153',
      '157',
      '252',
      '253',
      '254',
      '255',
      '256',
      '257',
      '258',
      '259',
      '260',
      '261',
      '262',
      '354',
      '356',
      '357',
      '358-1',
      '358-2',
      '358-3',
      '358-4',
      '359',
      '425',
      '528'
    ]
  },
  {
    placeName: '다산관',
    spaceIDs: [
      'B105',
      'B106',
      'B108',
      'B109',
      'B112',
      'B114',
      'B115',
      'B121',
      '105',
      '106',
      '107',
      '108',
      '109',
      '110',
      '111',
      '115',
      '205A',
      '205B',
      '307',
      '310',
      '311',
      '505',
      '506',
      '507'
    ]
  },
  {
    placeName: '종합관',
    spaceIDs: [
      '101',
      '102',
      '104',
      '105',
      '502',
      '503',
      '508',
      '509',
      '612',
      '613'
    ]
  },
  {
    placeName: '원천관',
    spaceIDs: [
      '101',
      '103',
      '235',
      '237',
      '242',
      '243',
      '251',
      '340',
      '502',
      '503',
      '505',
      '506',
      '507',
      '535',
      '539',
      '540'
    ]
  },
  {
    placeName: '원천정보관',
    spaceIDs: [
      '301',
      '302',
      '303',
      '304',
      '305',
      '306',
      '307',
      '308'
    ]
  },
  {
    placeName: '서관',
    spaceIDs: [
      '101',
      '107',
      '135',
      '239',
      '303',
      '305',
      '307',
      '331',
      '332',
      '334'
    ]
  }
]
